tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "sambadevi/powerlevel9k"
tap "heroku/brew"
tap "AdoptOpenJDK/openjdk"
tap "azure/functions"


# machine
brew "antigen"
brew "coreutils"
brew "dos2unix"
brew "gpg"
brew "htop"
brew "httpstat"
brew "jq"
brew "mas"
brew "mkcert"
brew "pinentry-mac"
brew "powerlevel9k"
brew "wrk"
brew "zsh"

# languages
brew "jenv"
brew "golang"
brew "nvm"
brew "yarn"
brew "pyenv"

# cloudnative
brew "awscli"
brew "azure-cli"
brew "azure-functions-core-tools@3"
brew "faas-cli"
brew "heroku"
brew "kubectx"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "stern"

# machine
cask "alfred"
cask "backblaze"
cask "dashlane"
cask "font-inconsolata-dz-for-powerline"
cask "franz"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "keybase"
cask "keystore-explorer"
cask "iterm2"
cask "jiggler"
cask "signal"
cask "spotify"
cask "sublime-text"
cask "tunnelblick"
cask "tuple"
cask "vlc"
cask "zoomus"

# containers
cask "docker"

# languages
cask "adoptopenjdk11"
cask "yourkit-java-profiler"
