tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "sambadevi/powerlevel9k"
tap "heroku/brew"
tap "http4k/tap"
tap "aws/tap"
tap "AdoptOpenJDK/openjdk"
tap "azure/functions"
tap "charmbracelet/tap"

# machine
brew "act"
brew "antigen"
brew "coreutils"
brew "dos2unix"
brew "authy"
brew "fd"
brew "gpg"
brew "htop"
brew "httpstat"
brew "jq"
brew "just"
brew "mas"
brew "mkcert"
brew "rename"
brew "pinentry-mac"
brew "powerlevel9k"
brew "watchexec"
brew "zsh"

#misc
brew "libtool"
brew "graphviz"

# languages
brew "jenv"
brew "nvm"
brew "yarn"
brew "pyenv"
brew "openjdk@17"

# cloudnative
brew "awscli"
brew "heroku"
brew "http4k"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "stern"

# machine
cask "alfred"
cask "appcleaner"
cask "backblaze"
cask "dashlane"
cask "ferdium"
cask "firefox"
cask "font-inconsolata-dz-for-powerline"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "jiggler"
cask "keybase"
cask "keystore-explorer"
cask "iterm2"
cask "obsidian"
cask "signal"
cask "slack"
cask "sublime-text"
cask "tuple"
cask "vlc"
cask "zoomus"

# containers
cask "docker"
cask "redisinsight"

# languages
cask "temurin11"
cask "yourkit-java-profiler"
