tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/versions"
tap "caskroom/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "sambadevi/powerlevel9k"

brew "awscli"
brew "gpg"
brew "stern"
brew "dos2unix"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubectx"
brew "zsh"
brew "golang"
brew "antigen"
brew "htop"
brew "coreutils"
brew "jenv"
brew "jq"
brew "powerlevel9k"
brew "mas"

cask "alfred"
cask "dashlane"
cask "docker"
cask "font-inconsolata-dz-for-powerline"
cask "franz"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jiggler"
cask "sublime-text"
cask "zoomus"

mas "GIPHY Capture", id 668208984

